from collections import OrderedDict
glossary = OrderedDict()
glossary['конкатенація'] = 'операція склеювання об\'єктів лінійної структури, зазвичай рядків'
glossary['компілятор'] = 'комп\'ютерна програма (або їх набір), що перетворює (компілює) вихідний код, написаний певною мовою\n програмування (вихідна мова, англ. source language), на семантично еквівалентний код в іншій мові програмування (цільова мова, англ. targetlanguage),\nякий зазвичай необхідний для виконання програми машиною, наприклад, комп\'ютером'
glossary['інтерпритатор'] = 'програма чи технічні засоби, необхідні для виконання інших програм, вид транслятора, який здійснює\n пооператорну (покомандну, построкову) обробку, перетворення у машинний код та виконання програми або запиту (на відміну від компілятора,\nякий транслює у машинні коди всю програму без її виконання)'
glossary['домен'] = 'частина простору ієрархічних імен мережі Інтернет, що обслуговується групою серверів системи доме́нних імен\n (DNS-серверів) та централізовано адмініструється'
glossary['хост'] = 'Комп\'ютерний сервер, тобто пристрій, що містить ресурс і надає до нього доступ у форматі клієнт-сервер'
glossary['ітерація'] = 'це акт повторення процесу з метою створення послідовності результатів (можливо необмежених)\nз метою наближення до бажаної мети або результату'
glossary['препроцесор'] = 'програма, яка виконує попередню обробку даних, для того, щоб вони могли використовуватись\nіншою програмою, наприклад, такою як компілятор'
glossary['ооп'] = 'одна з парадигм програмування, яка розглядає програму як множину «об\'єктів», що взаємодіють між собою'
glossary['хешування'] = 'перетворення вхідного масиву даних довільної довжини у вихідний бітовий рядок фіксованої довжини'
glossary['парсинг'] = 'збір та систиматизування інформації, розміщену на певних сайтах'

for key, value in glossary.items():
    print(f'{key.upper()}: {value}.\n')
print('--------------------------------------------------------------------------------------------------------------')

glossary = OrderedDict()
glossary['домен'] = 'частина простору ієрархічних імен мережі Інтернет, що обслуговується групою серверів системи доме́нних імен\n (DNS-серверів) та централізовано адмініструється'
glossary['компілятор'] = 'комп\'ютерна програма (або їх набір), що перетворює (компілює) вихідний код, написаний певною мовою\n програмування (вихідна мова, англ. source language), на семантично еквівалентний код в іншій мові програмування (цільова мова, англ. targetlanguage),\nякий зазвичай необхідний для виконання програми машиною, наприклад, комп\'ютером'
glossary['інтерпритатор'] = 'програма чи технічні засоби, необхідні для виконання інших програм, вид транслятора, який здійснює\n пооператорну (покомандну, построкову) обробку, перетворення у машинний код та виконання програми або запиту (на відміну від компілятора,\nякий транслює у машинні коди всю програму без її виконання)'
glossary['парсинг'] = 'збір та систиматизування інформації, розміщену на певних сайтах'
glossary['хост'] = 'Комп\'ютерний сервер, тобто пристрій, що містить ресурс і надає до нього доступ у форматі клієнт-сервер'
glossary['препроцесор'] = 'програма, яка виконує попередню обробку даних, для того, щоб вони могли використовуватись\nіншою програмою, наприклад, такою як компілятор'
glossary['ооп'] = 'одна з парадигм програмування, яка розглядає програму як множину «об\'єктів», що взаємодіють між собою'
glossary['конкатенація'] = 'операція склеювання об\'єктів лінійної структури, зазвичай рядків'
glossary['хешування'] = 'перетворення вхідного масиву даних довільної довжини у вихідний бітовий рядок фіксованої довжини'
glossary['ітерація'] = 'це акт повторення процесу з метою створення послідовності результатів (можливо необмежених)\nз метою наближення до бажаної мети або результату'

for key, value in glossary.items():
    print(f'{key.upper()}: {value}.\n')
